results/4-loadtest/azure_results/azure_python_400.txt
Running 1m test @ https://python-matrix-linux-679-westeurope.azurewebsites.net/api/matrix
  2 threads and 400 connections
  Thread calibration: mean lat.: 5858.297ms, rate sampling interval: 18186ms
  Thread calibration: mean lat.: 5533.692ms, rate sampling interval: 18251ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.36s     7.84s   48.53s    59.52%
    Req/Sec   153.50    126.05   284.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.64s 
 75.000%   14.90s 
 90.000%   20.12s 
 99.000%   28.48s 
 99.900%   43.25s 
 99.990%   47.87s 
 99.999%   48.56s 
100.000%   48.56s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      22.591     0.000000            1         1.00
      52.287     0.100000         2162         1.11
     652.799     0.200000         4316         1.25
    3332.095     0.300000         6474         1.43
    5955.583     0.400000         8635         1.67
    8642.559     0.500000        10795         2.00
    9871.359     0.550000        11870         2.22
   11100.159     0.600000        12950         2.50
   12394.495     0.650000        14026         2.86
   13606.911     0.700000        15112         3.33
   14901.247     0.750000        16184         4.00
   15630.335     0.775000        16735         4.44
   16392.191     0.800000        17265         5.00
   17170.431     0.825000        17807         5.71
   17924.095     0.850000        18344         6.67
   18907.135     0.875000        18880         8.00
   19431.423     0.887500        19152         8.89
   20135.935     0.900000        19425        10.00
   20725.759     0.912500        19690        11.43
   21430.271     0.925000        19963        13.33
   22249.471     0.937500        20233        16.00
   22659.071     0.943750        20364        17.78
   23166.975     0.950000        20501        20.00
   23642.111     0.956250        20636        22.86
   24199.167     0.962500        20769        26.67
   24838.143     0.968750        20903        32.00
   25149.439     0.971875        20974        35.56
   25477.119     0.975000        21041        40.00
   25870.335     0.978125        21108        45.71
   26296.319     0.981250        21174        53.33
   26869.759     0.984375        21243        64.00
   27197.439     0.985938        21275        71.11
   27656.191     0.987500        21308        80.00
   28164.095     0.989062        21343        91.43
   28803.071     0.990625        21375       106.67
   29769.727     0.992188        21409       128.00
   30326.783     0.992969        21426       142.22
   31080.447     0.993750        21443       160.00
   32505.855     0.994531        21460       182.86
   33685.503     0.995313        21476       213.33
   35422.207     0.996094        21493       256.00
   36372.479     0.996484        21503       284.44
   37257.215     0.996875        21510       320.00
   37978.111     0.997266        21519       365.71
   39157.759     0.997656        21527       426.67
   40239.103     0.998047        21536       512.00
   41025.535     0.998242        21540       568.89
   41451.519     0.998437        21544       640.00
   42172.415     0.998633        21548       731.43
   42795.007     0.998828        21552       853.33
   43286.527     0.999023        21556      1024.00
   43778.047     0.999121        21559      1137.78
   44204.031     0.999219        21561      1280.00
   44662.783     0.999316        21563      1462.86
   44990.463     0.999414        21565      1706.67
   45645.823     0.999512        21567      2048.00
   45711.359     0.999561        21568      2275.56
   45973.503     0.999609        21569      2560.00
   46235.647     0.999658        21570      2925.71
   46628.863     0.999707        21571      3413.33
   46923.775     0.999756        21572      4096.00
   47218.687     0.999780        21573      4551.11
   47218.687     0.999805        21573      5120.00
   47579.135     0.999829        21574      5851.43
   47579.135     0.999854        21574      6826.67
   47874.047     0.999878        21575      8192.00
   47874.047     0.999890        21575      9102.22
   47874.047     0.999902        21575     10240.00
   48168.959     0.999915        21576     11702.86
   48168.959     0.999927        21576     13653.33
   48168.959     0.999939        21576     16384.00
   48168.959     0.999945        21576     18204.44
   48168.959     0.999951        21576     20480.00
   48562.175     0.999957        21577     23405.71
   48562.175     1.000000        21577          inf
#[Mean    =     9364.575, StdDeviation   =     7841.183]
#[Max     =    48529.408, Total count    =        21577]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  21872 requests in 1.00m, 5.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 7402
  Non-2xx or 3xx responses: 20952
Requests/sec:    364.50
Transfer/sec:     99.94KB