results/4-loadtest/azure_results/azure_win_dotnet_10.txt
Running 1m test @ https://dotnet-matrix-windows-205-westeurope.azurewebsites.net/api/matrix
  2 threads and 10 connections
  Thread calibration: mean lat.: 94.762ms, rate sampling interval: 240ms
  Thread calibration: mean lat.: 291.419ms, rate sampling interval: 819ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    98.87ms   67.98ms 592.38ms   87.80%
    Req/Sec     4.87      6.68    20.00     85.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   77.31ms
 75.000%  105.54ms
 90.000%  188.41ms
 99.000%  310.78ms
 99.900%  592.90ms
 99.990%  592.90ms
 99.999%  592.90ms
100.000%  592.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      41.151     0.000000            1         1.00
      49.471     0.100000           51         1.11
      55.199     0.200000          100         1.25
      61.695     0.300000          150         1.43
      69.311     0.400000          200         1.67
      77.311     0.500000          250         2.00
      80.703     0.550000          275         2.22
      86.207     0.600000          300         2.50
      90.943     0.650000          325         2.86
      96.831     0.700000          350         3.33
     105.535     0.750000          375         4.00
     110.463     0.775000          388         4.44
     120.703     0.800000          400         5.00
     133.247     0.825000          414         5.71
     142.719     0.850000          425         6.67
     163.455     0.875000          438         8.00
     180.479     0.887500          444         8.89
     188.415     0.900000          450        10.00
     204.927     0.912500          457        11.43
     215.935     0.925000          463        13.33
     225.279     0.937500          469        16.00
     230.911     0.943750          472        17.78
     237.695     0.950000          475        20.00
     243.711     0.956250          479        22.86
     252.799     0.962500          482        26.67
     257.663     0.968750          485        32.00
     259.839     0.971875          486        35.56
     263.423     0.975000          489        40.00
     271.871     0.978125          490        45.71
     279.039     0.981250          491        53.33
     286.207     0.984375          494        64.00
     286.207     0.985938          494        71.11
     286.207     0.987500          494        80.00
     310.783     0.989062          495        91.43
     403.199     0.990625          496       106.67
     462.591     0.992188          497       128.00
     462.591     0.992969          497       142.22
     462.591     0.993750          497       160.00
     486.655     0.994531          498       182.86
     486.655     0.995313          498       213.33
     574.463     0.996094          499       256.00
     574.463     0.996484          499       284.44
     574.463     0.996875          499       320.00
     574.463     0.997266          499       365.71
     574.463     0.997656          499       426.67
     592.895     0.998047          500       512.00
     592.895     1.000000          500          inf
#[Mean    =       98.867, StdDeviation   =       67.977]
#[Max     =      592.384, Total count    =          500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 1.00m, 163.20KB read
Requests/sec:     10.02
Transfer/sec:      2.72KB